#ifndef NOMPROJET_MAP_H
#define NOMPROJET_MAP_H
#include <SFML\Graphics.hpp>
const int HEIGHT_MAP = 48;//размер карты высота
const int WIDTH_MAP = 75;//размер карты ширина

sf::String TileMap[HEIGHT_MAP] = {
        "2222222222222222222222222222222222222222222222222222222222222222222222222",
        "1                                                                       1",
        "1                                                                       1",
        "1  s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s  1",
        "1                                                                       1",
        "1  s                                                                 s  1",
        "1      11111        1111111111111111111111111111111111       11111      1",
        "1  s   1   1           s  1                   1  s           1   1   s  1",
        "1      1   1              1                   1              1   1      1",
        "1  s   1   1           s  1                   1  s           1   1   s  1",
        "1      11111              1                   1              11111      1",
        "1  s                   s  1                   1  s                   s  1",
        "1                         1                   1                         1",
        "1  s                   s  1                   1  s                   s  1",
        "1                         1                   1                         1",
        "1  s                   s  11111           11111  s                   s  1",
        "1        1                                                     1        1",
        "1  s     1                                                     1     s  1",
        "1        1                                                     1        1",
        "1  s     1          s s s s s s s s s s s s s s s s            1     s  1",
        "1        1                                                     1        1",
        "1  s     1                                                     1     s  1",
        "1        1         1111111111111111111111111111111111          1        1",
        "1  s     1                  1                                  1     s  1",
        "1        1                  1 s                                1        1",
        "1  s     1                  1                                  1     s  1",
        "1        1                  1 s                                1        1",
        "1  s     1                  1                                  1     s  1",
        "1        1                  1 s        s  1                    1        1",
        "1  s     1                  1             1                    1     s  1",
        "1                           1 s        s  1                             1",
        "1  s                                      1                          s  1",
        "1                                      s  1              f              1",
        "1  s                                      1                          s  1",
        "1                                      s  1                             1",
        "1  s                                      1                          s  1",
        "1      11111        1111111111111111111111111111111111       11111      1",
        "1  s   1   1               1    s s s s s s s    1           1   1   s  1",
        "1      1   1               1  s                s 1   s       1   1      1",
        "1  s   1   1               1                     1           1   1   s  1",
        "1      11111               1  s                s 1   s       11111      1",
        "1  s                                             1                   s  1",
        "1                                              s 1   s                  1",
        "1  s                                             1                   s  1",
        "1                                              s 1   s                  1",
        "1  s s s s s s s s s s s s s s s s s s s s s s   1     s s  s  s  s  s  1",
        "1                                                1                      1",
        "2222222222222222222222222222222222222222222222222222222222222222222222222",

};

#endif //NOMPROJET_MAP_H
